Horizon-fyz/ESP32-S3-above/sdkconfig.defaults
# =====================================================
# ESP32-S3-ETH 水上主控节点 sdkconfig 默认值
# 板卡: Waveshare ESP32-S3-ETH (ESP32-S3R8, 8MB Octal PSRAM, 16MB Flash)
# 硬件: 板载 W5500 + MPU6050(I2C0) + 亚博10轴IMU(I2C1) + PCA9685 + 4 ESC + 1 L298N + GPS
# =====================================================

# 目标芯片 —— 必须声明, 否则 sdkconfig 丢失时会回落 IDF 默认的 esp32
CONFIG_IDF_TARGET="esp32s3"

# 板载 Flash 16MB (W25Q128FS)
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# 日志走 UART0 (GPIO43/44), 115200
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

# Enable DHCP ARP check to detect IP address conflicts on the network
CONFIG_LWIP_DHCP_DOES_ARP_CHECK=y
